[
    {
        "id": 1,
        "title": "Engine",
        "description": "The engine is the heart of the vehicle, responsible for generating power by burning fuel and providing the necessary force to propel the car."
    },
    {
        "id": 2,
        "title": "Transmission",
        "description": "The transmission is a crucial component that controls the power generated by the engine and manages the speed and torque of the vehicle."
    },
    {
        "id": 3,
        "title": "Brake System",
        "description": "The brake system includes components such as brake pads, rotors, and calipers, responsible for slowing down and stopping the car when needed."
    },
    {
        "id": 4,
        "title": "Suspension System",
        "description": "The suspension system enhances the car's ride comfort and handling by absorbing shocks and vibrations from the road surface."
    },
    {
        "id": 5,
        "title": "Tires",
        "description": "Tires provide traction and grip on the road, contributing to the overall stability and performance of the vehicle."
    },
    {
        "id": 6,
        "title": "Battery",
        "description": "The battery stores electrical energy and provides power to start the engine and operate electrical components when the car is not running."
    },
    {
        "id": 7,
        "title": "Alternator",
        "description": "The alternator generates electrical power to recharge the battery and supply electricity to the car's electrical systems while the engine is running."
    },
    {
        "id": 8,
        "title": "Starter Motor",
        "description": "The starter motor is responsible for turning the engine over during the ignition process, initiating the combustion cycle."
    },
    {
        "id": 9,
        "title": "Fuel Pump",
        "description": "The fuel pump delivers fuel from the gas tank to the engine, ensuring a consistent and proper supply for combustion."
    },
    {
        "id": 10,
        "title": "Radiator",
        "description": "The radiator helps regulate the engine temperature by dissipating heat from the coolant, preventing the engine from overheating."
    },
    {
        "id": 11,
        "title": "Exhaust System",
        "description": "The exhaust system guides and filters the gases produced during the combustion process and helps reduce emissions while minimizing noise."
    },
    {
        "id": 12,
        "title": "Catalytic Converter",
        "description": "The catalytic converter reduces harmful emissions by converting pollutants into less harmful substances before they exit the exhaust system."
    },
    {
        "id": 13,
        "title": "Ignition System",
        "description": "The ignition system produces the spark needed to ignite the air-fuel mixture in the engine cylinders, starting the combustion process."
    },
    {
        "id": 14,
        "title": "Air Filter",
        "description": "The air filter cleans the air entering the engine, removing dust and debris to ensure optimal combustion and engine performance."
    },
    {
        "id": 15,
        "title": "Oil Filter",
        "description": "The oil filter removes impurities from the engine oil, preventing contaminants from damaging engine components and ensuring lubrication efficiency."
    },
    {
        "id": 16,
        "title": "Power Steering Pump",
        "description": "The power steering pump provides hydraulic assistance to make steering easier for the driver, improving vehicle maneuverability."
    },
    {
        "id": 17,
        "title": "Drive Belt",
        "description": "The drive belt connects and powers various engine components, such as the alternator, water pump, and power steering pump."
    },
    {
        "id": 18,
        "title": "Timing Belt",
        "description": "The timing belt synchronizes the rotation of the engine's camshaft and crankshaft, ensuring proper engine timing and smooth operation."
    },
    {
        "id": 19,
        "title": "Thermostat",
        "description": "The thermostat regulates the engine temperature by controlling the flow of coolant, helping maintain optimal operating conditions."
    },
    {
        "id": 20,
        "title": "Oxygen Sensor",
        "description": "The oxygen sensor monitors the oxygen level in the exhaust gases, providing feedback to the engine control module for efficient fuel combustion."
    },
    {
        "id": 21,
        "title": "Spark Plugs",
        "description": "Spark plugs generate the spark needed to ignite the air-fuel mixture in each engine cylinder, facilitating combustion and power generation."
    },
    {
        "id": 22,
        "title": "Distributor",
        "description": "The distributor distributes electrical current to the spark plugs, coordinating the ignition timing for each cylinder in older ignition systems."
    },
    {
        "id": 23,
        "title": "Ignition Coil",
        "description": "The ignition coil amplifies the electrical voltage from the battery, creating a high-energy spark for the spark plugs to ignite the fuel mixture."
    },
    {
        "id": 24,
        "title": "Wheel Bearings",
        "description": "Wheel bearings allow the wheels to rotate smoothly on the axles, reducing friction and contributing to the overall handling and performance of the vehicle."
    },
    {
        "id": 25,
        "title": "Shocks and Struts",
        "description": "Shocks and struts absorb and dampen vibrations and shocks from the road, providing a smoother ride and better vehicle stability."
    },
    {
        "id": 26,
        "title": "Steering Rack",
        "description": "The steering rack converts the rotational motion of the steering wheel into lateral motion to control the direction of the front wheels."
    },
    {
        "id": 27,
        "title": "Control Arms",
        "description": "Control arms connect the suspension system to the vehicle frame and support the wheels, contributing to the stability and alignment of the car."
    },
    {
        "id": 28,
        "title": "Ball Joints",
        "description": "Ball joints connect the control arms to the steering knuckles, allowing for the movement of the suspension and steering systems."
    },
    {
        "id": 29,
        "title": "Fuel Injector",
        "description": "Fuel injectors deliver precise amounts of fuel into the engine cylinders, ensuring efficient combustion and optimal engine performance."
    },
    {
        "id": 30,
        "title": "EGR Valve",
        "description": "The EGR valve recirculates a portion of exhaust gases back into the engine cylinders, reducing nitrogen oxide emissions and controlling combustion temperature."
    }
]
